In [49]:
import sqlite3

In [50]:
#Connect to an SQLite Database
connection = sqlite3.connect('database.db')
connection

In [51]:
cursor = connection.cursor()

In [52]:
#Create a table
cursor.execute('''
Create Table If not Exists Employees(
    id Integer Primary Key,
    name Text Not Null,
    age Integer,
    department text           
    )
''')

#Commit the connection
connection.commit()

In [53]:
cursor.execute('''
    Select * From Employees
''')

In [54]:
#Insert the data in sqlite database
cursor.execute('''
Insert Into Employees(name, age, department)
    values('Anuraag', '25', 'Software Engineer')
''')

cursor.execute('''
Insert Into Employees(name, age, department)
    values('Shivansh', '27', 'Software Engineer')
''')

cursor.execute('''
Insert Into Employees(name, age, department)
    values('Atinder', '27', 'Software Engineer')
''')

#Commit
connection.commit()

In [55]:
#Query the data from table
cursor.execute('Select * from Employees')
rows = cursor.fetchall()

#Print all data
for row in rows:
    print(row)

(1, 'Anuraag', 25, 'Software Engineer')
(2, 'Shivansh', 27, 'Software Engineer')
(3, 'Atinder', 27, 'Software Engineer')

In [56]:
#Update the data in the table
cursor.execute('''
UPDATE Employees
Set age = 34
where name = 'Anuraag'
''')

connection.commit()

In [57]:
#Query the data from table
cursor.execute('Select * from Employees')
rows = cursor.fetchall()

#Print all data
for row in rows:
    print(row)

(1, 'Anuraag', 34, 'Software Engineer')
(2, 'Shivansh', 27, 'Software Engineer')
(3, 'Atinder', 27, 'Software Engineer')

In [59]:
#Delete from Database
cursor.execute('''
DELETE from Employees
    where name = 'Anuraag'
''')

connection.commit()

In [60]:
#Query the data from table
cursor.execute('Select * from Employees')
rows = cursor.fetchall()

#Print all data
for row in rows:
    print(row)

(2, 'Shivansh', 27, 'Software Engineer')
(3, 'Atinder', 27, 'Software Engineer')

In [70]:
#Working with sales data
#Connect to an SQlite database

connection = sqlite3.connect('sale_data_db')
cursor = connection.cursor()

#Create a table for sales data
cursor.execute('''
CREATE TABLE IF NOT EXISTS sales(
    id INTEGER PRIMARY KEY,
    date TEXT NOT NULL,
    product TEXT NOT NULL,
    sales INTEGER,
    region TEXT
)
''')

#Insert data into the tables
sales_data = [
    ('2023-01-02', 100, 'Product-1', 'North'),
    ('2023-01-03', 110, 'Product-2', 'Outer-Region'),
    ('2023-01-04', 170, 'Product-3', 'South'),
    ('2023-01-05', 150, 'Product-4', 'East'),
    ('2023-01-06', 140, 'Product-5', 'West'),
    ('2023-01-07', 200, 'Product-6', 'Center')
]

cursor.executemany('''
Insert into sales(date, product, sales, region)
                   values(?,?,?,?)
''', sales_data)

connection.commit()

In [71]:
#Query the data from table
cursor.execute('Select * from sales')
rows = cursor.fetchall()

#Print all data
for row in rows:
    print(row)

(1, '2023-01-02', '100', 'Product-1', 'North')
(2, '2023-01-03', '110', 'Product-2', 'Outer-Region')
(3, '2023-01-04', '170', 'Product-3', 'South')
(4, '2023-01-05', '150', 'Product-4', 'East')
(5, '2023-01-06', '140', 'Product-5', 'West')
(6, '2023-01-07', '200', 'Product-6', 'Center')

In [72]:
#Close the connection
connection.close()